import { MatchingData } from "@/types/types";

export const sampleMatchingData: MatchingData = {
  session_id: "fab007c4-24a0-422f-b574-02745969309a",
  leftovers: {
    "ТЕ-00290707": {
      product: "Макксалія інс. укр. (50К) власне виробництво 2024",
      note_text: "ТЕ-00072647-13",
      total_ordered: 13,
      total_moved: 15,
      current_moved: [
        {
          index: 2981,
          "Заявка на відвантаження": "ТЕ-00290707",
          Номенклатура: "Макксалія інс. укр. (50К)",
          Заказано: 13,
          Примечание_заказано: "ТЕ-00072647-13",
          "Партія номенклатури": "UA-24-123/0279-21",
          Перемещено: 15,
          "Вид діяльності": "Насіння",
          "Ознака партії": "власне виробництво",
          "Сезон закупівлі": 2024,
          Товар: "Макксалія інс. укр. (50К) власне виробництво 2024",
        },
      ],
      current_notes: [
        {
          index: 0,
          Договор: "ТЕ-00072647",
          Количество_в_примечании: 13,
        },
      ],
    },
    "ТЕ-00290720": {
      product: "СИ Теос інс. (150К) звичайна 2026",
      note_text: "ТЕ-00070394-50/ТЕ-00072557-33/ТЕ-00072806-8/ТЕ-00072237-10",
      total_ordered: 43,
      total_moved: 43,
      current_moved: [
        {
          index: 2991,
          "Заявка на відвантаження": "ТЕ-00290720",
          Номенклатура: "СИ Теос інс. (150К)",
          Заказано: 43,
          Примечание_заказано:
            "ТЕ-00070394-50/ТЕ-00072557-33/ТЕ-00072806-8/ТЕ-00072237-10",
          "Партія номенклатури": "H-24-096/1032",
          Перемещено: 43,
          "Вид діяльності": "Насіння",
          "Ознака партії": "звичайна",
          "Сезон закупівлі": 2026,
          Товар: "СИ Теос інс. (150К) звичайна 2026",
        },
      ],
      current_notes: [
        {
          index: 0,
          Договор: "ТЕ-00070394",
          Количество_в_примечании: 50,
        },
        {
          index: 1,
          Договор: "ТЕ-00072557",
          Количество_в_примечании: 33,
        },
        {
          index: 2,
          Договор: "ТЕ-00072806",
          Количество_в_примечании: 8,
        },
        {
          index: 3,
          Договор: "ТЕ-00072237",
          Количество_в_примечании: 10,
        },
      ],
    },
  },
};
